In [8]:
import numpy as np
import pandas as pd

In [9]:
dict1={'Name':["Avinash","Rajesh",None,"Akshay"],
       'Age':[30,29,np.nan,32],
       'City':["Pune","Mumbai",np.nan,"Banglore"]}
dict1

{'Name': ['Avinash', 'Rajesh', None, 'Akshay'],
 'Age': [30, 29, nan, 32],
 'City': ['Pune', 'Mumbai', nan, 'Banglore']}

In [11]:
d = pd.DataFrame(dict1)
d

      Name   Age      City
0  Avinash  30.0      Pune
1   Rajesh  29.0    Mumbai
2     None   NaN       NaN
3   Akshay  32.0  Banglore